<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest Linear

	Valid BUILD arguments are:
	- "x86": For Intel Macs
	- "arm64": For Apple Silicon Macs</string>
	<key>Identifier</key>
	<string>com.github.securitygeneration.download.Linear</string>
	<key>Input</key>
	<dict>
		<key>BUILD</key>
		<string>x86</string>
		<key>NAME</key>
		<string>Linear</string>
		<key>RELEASE</key>
		<string>fresh</string>
		<key>DOWNLOAD_URL</key>
		<string>https://desktop.linear.app/mac/dmg/%BUILD%</string>
		<key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
		<false/>
	</dict>
	<key>MinimumVersion</key>
	<string>0.4.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>URLDownloader</string>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
				<key>filename</key>
				<string>%NAME%.dmg</string>
			</dict>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/%NAME%.dmg/Linear.app</string>
				<key>requirement</key>
				<string>identifier "com.linear" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "7VZ2S3V9RV"</string>
				<key>strict_verification</key>
				<true />
			</dict>
		</dict>
	</array>
</dict>
</plist>
